[
    {
      "model": "item_types.monitoringcategory",
      "pk": 1,
      "fields": {
        "title": "Simple Checks",
        "description": "Performs lightweight, agent-less checks for service availability.",
        "long_description": "These checks verify the availability and basic performance of network services like ping, HTTP, FTP, and DNS. No software needs to be installed on the remote systems, making them ideal for quick health checks."
      }
    },
    {
      "model": "item_types.monitoringcategory",
      "pk": 2,
      "fields": {
        "title": "Agent-Based Monitoring",
        "description": "Collects detailed data from devices using installed agents.",
        "long_description": "Installed agents collect rich performance metrics like CPU, memory, disk usage, and more. This method is suitable when you need deep insights and have direct access to the system."
      }
    },
    {
      "model": "item_types.monitoringcategory",
      "pk": 3,
      "fields": {
        "title": "Network Protocol Monitoring",
        "description": "Uses standard network protocols to monitor devices without agents.",
        "long_description": "Monitors hardware like routers and switches using SNMP, IPMI, or similar protocols. No installation is needed, making this ideal for network infrastructure monitoring."
      }
    },
    {
      "model": "item_types.monitoringcategory",
      "pk": 4,
      "fields": {
        "title": "Remote Service Monitoring",
        "description": "Checks service availability and response remotely.",
        "long_description": "Simulates user access or requests to ensure services and websites are online. Useful for checking if servers respond to SSH, websites are up, or ports are open."
      }
    },
    {
      "model": "item_types.monitoringcategory",
      "pk": 5,
      "fields": {
        "title": "Log and File Monitoring",
        "description": "Scans log files for issues or important events.",
        "long_description": "Analyzes logs to detect errors, warnings, or specific patterns. Helps with early detection of issues from system, application, or security logs."
      }
    },
    {
      "model": "item_types.monitoringcategory",
      "pk": 6,
      "fields": {
        "title": "Calculated and Dependent Monitoring",
        "description": "Generates new data by processing existing metrics.",
        "long_description": "Uses formulas and relationships between data to produce insights. Helpful for reducing overhead and creating advanced dashboards or alerts."
      }
    },
    {
      "model": "item_types.monitoringcategory",
      "pk": 7,
      "fields": {
        "title": "Custom and External Monitoring",
        "description": "Executes user-defined scripts or connects to external tools.",
        "long_description": "Runs custom scripts or integrates with external systems. Ideal for advanced use cases or monitoring special-purpose infrastructure."
      }
    }
  ]
  